package com.kh.Test240208;

public class Run {

	public static void main(String[] args) {
		/*
		 *  * MVC 패턴
		 *  	각 클래스마다 역할(데이터, 화면, 요청처리)을 부여해서 작업!
		 *  	=> 유지보수가 용이
		 *  
		 *  * M : 모델(model)
		 *  	데이터를 담당하는 역할
		 *  		데이터들을 담기 위한 클래스
		 *  		비즈니스로직 처리 위한 클래스
		 *  		데이터가 보관되어있는 보관함과 연결해서 입출력해주기 위한 클래스
		 *  	VO(value object) 데이터를 저장하는 객체
		 *
		 *	* V : 뷰(View)
		 *		화면을 담당하는 역할. 즉, 사용자에게 보여지는 시각적인 요소(출력문, 입력문)
		 *
		 *	* C : 컨트롤러(Controller)
		 *		사용자가 요청한 내용을 처리한 후 그 결과를 돌려주는 역할
		 *
		 */
	}

}
